test/support/fixtures/stripe/charge_succeeded_event.json

{
  "object": {
    "id": "ch_chargeid",
    "amount": 500,
    "amount_refunded": 0,
    "application_fee_amount": null,
    "created": 1546332337,
    "currency": "usd",
    "customer": "cus_customerid",
    "invoice": null,
    "payment_method_details": {
      "card": {
        "brand": "Visa",
        "exp_month": 1,
        "exp_year": 2019,
        "last4": "4444"
      }
    },
    "stripe_account": null
  }
}
